List of all members
API_IEventNotifier Class Reference
Notifications Manager
Defining an interface for a class that will be used to notify all event handlers. More...
#include <APIdefs_Callback.h>
 Inheritance diagram for API_IEventNotifier:
Detailed Description
Defining an interface for a class that will be used to notify all event handlers.
Since
Archicad 26